   # Case Study on Measures of Central Tendency and Dispersion

In [33]:
# importing necessary libraries

In [1]:
import numpy as np
import pandas as pd

In [2]:
stud=pd.read_csv('D:\DSA\case study\StudentsPerformance.csv') # data accessing from local system

## 1. Find out how many males and females participated in the test.

In [3]:
stud

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

In [4]:
stud.value_counts('gender') # displaying genderwise count

gender
female    518
male      482
dtype: int64

## 2. What do you think about the students' parental level of education?

In [5]:
stud.value_counts('parental level of education') # count of different categories of education

parental level of education
some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
dtype: int64

Insights:

Parents having masters degree are the least and higher no of parents have attended some colleges.It is clear that all are literate

## 3. Who scores the most on average for math, reading and writing based on
### ● Gender
### ● Test preparation course

In [6]:
result1 = stud.groupby('gender').mean() # finding mean based on gender

In [7]:
result1

        math score  reading score  writing score
gender
female   63.376448      72.590734      72.467181
male     68.821577      65.545643      63.446058

In [8]:
result2 = stud.groupby('test preparation course').mean() # finding mean based on test preparation course

In [9]:
result2

                         math score  reading score  writing score
test preparation course
completed                  69.96648      74.175978      74.684358
none                       63.78972      66.417445      64.457944

## 4. What do you think about the scoring variation for math, reading and writing based on
### ● Gender

In [10]:
stud.groupby('gender')['math score','reading score','writing score'].var()

<ipython-input-10-50b55bf95f0a>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  stud.groupby('gender')['math score','reading score','writing score'].var()

        math score  reading score  writing score
gender
female  256.958593     207.677438     220.369327
male    211.889097     200.211010     202.413924

Females have higher values than males of variance,so males are more consistent

### ● Test preparation course

In [13]:
stud.groupby('test preparation course')['math score','reading score','writing score'].var()

<ipython-input-13-0dfa4604021c>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  stud.groupby('test preparation course')['math score','reading score','writing score'].var()

                         math score  reading score  writing score
test preparation course
completed                210.884027     183.265864     175.202612
none                     246.668662     213.419851     226.251739

Candidates who have completed preparation course seems more consistent than none

## 5. The management needs your help to give bonus points to the top 25% of students based on their maths score, so how will you help the management to achieve this.

In [31]:
bonus=stud.nlargest(250,['math score']).head(250) # to add  bonus to top 25% of population

In [32]:
bonus

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
515,female,group E,some college,standard,none,100,92,97
516,female,group E,bachelor's degree,standard,none,100,100,100
517,female,group E,associate's degree,standard,none,100,100,100
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
...,...,...,...,...,...,...,...,...
428,female,group D,some college,free/reduced,none,77,86,86
429,female,group E,some high school,standard,none,77,79,80
849,male,group A,bachelor's degree,standard,none,77,67,68
850,male,group C,associate's degree,free/reduced,none,77,67,64
851,male,group D,some college,standard,completed,77,62,62